# Напишите код на Python, реализующий расчет длины вектора,
# заданного его координатами. (в программе)

import numpy as np

numpy_array_1 = np.array([10,10,10])
numpy_array_2 = np.array([0,0,-10])
s = numpy_array_1 + numpy_array_2

print(s)


